yvkonkov91/Microcontrolers-arm/stm8/Project/lib/lib3/inc/iostm8s208cb.h
/* UART3 control register 3 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char             : 4;
  unsigned char STOP        : 2;
  unsigned char LINEN       : 1;
} __BITS_UART3_CR3;
#endif
__IO_REG8_BIT(UART3_CR3,   0x5246, __READ_WRITE, __BITS_UART3_CR3);

/* UART3 control register 4 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char ADD         : 4;
  unsigned char LBDF        : 1;
  unsigned char LBDL        : 1;
  unsigned char LBDIEN      : 1;
} __BITS_UART3_CR4;
#endif
__IO_REG8_BIT(UART3_CR4,   0x5247, __READ_WRITE, __BITS_UART3_CR4);

/* UART3 control register 6 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char LSF         : 1;
  unsigned char LHDF        : 1;
  unsigned char LHDIEN      : 1;
  unsigned char             : 1;
  unsigned char LASE        : 1;
  unsigned char LSLV        : 1;
  unsigned char             : 1;
  unsigned char LDUM        : 1;
} __BITS_UART3_CR6;
#endif
__IO_REG8_BIT(UART3_CR6,   0x5249, __READ_WRITE, __BITS_UART3_CR6);


/*-------------------------------------------------------------------------
 *      UART3 bit fields
 *-----------------------------------------------------------------------*/
#ifdef __IAR_SYSTEMS_ICC__

#define UART3_SR_PE              UART3_SR_bit.PE
#define UART3_SR_FE              UART3_SR_bit.FE
#define UART3_SR_NF              UART3_SR_bit.NF
#define UART3_SR_OR              UART3_SR_bit.OR
#define UART3_SR_IDLE            UART3_SR_bit.IDLE
#define UART3_SR_RXNE            UART3_SR_bit.RXNE
#define UART3_SR_TC              UART3_SR_bit.TC
#define UART3_SR_TXE             UART3_SR_bit.TXE

#define UART3_CR1_PIEN           UART3_CR1_bit.PIEN
#define UART3_CR1_PS             UART3_CR1_bit.PS
#define UART3_CR1_PCEN           UART3_CR1_bit.PCEN
#define UART3_CR1_WAKE           UART3_CR1_bit.WAKE
#define UART3_CR1_M              UART3_CR1_bit.M
#define UART3_CR1_UARTD          UART3_CR1_bit.UARTD
#define UART3_CR1_T8             UART3_CR1_bit.T8
#define UART3_CR1_R8             UART3_CR1_bit.R8

#define UART3_CR2_SBK            UART3_CR2_bit.SBK
#define UART3_CR2_RWU            UART3_CR2_bit.RWU
#define UART3_CR2_REN            UART3_CR2_bit.REN
#define UART3_CR2_TEN            UART3_CR2_bit.TEN
#define UART3_CR2_ILIEN          UART3_CR2_bit.ILIEN
#define UART3_CR2_RIEN           UART3_CR2_bit.RIEN
#define UART3_CR2_TCIEN          UART3_CR2_bit.TCIEN
#define UART3_CR2_TIEN           UART3_CR2_bit.TIEN

#define UART3_CR3_STOP           UART3_CR3_bit.STOP
#define UART3_CR3_LINEN          UART3_CR3_bit.LINEN

#define UART3_CR4_ADD            UART3_CR4_bit.ADD
#define UART3_CR4_LBDF           UART3_CR4_bit.LBDF
#define UART3_CR4_LBDL           UART3_CR4_bit.LBDL
#define UART3_CR4_LBDIEN         UART3_CR4_bit.LBDIEN

#define UART3_CR6_LSF            UART3_CR6_bit.LSF
#define UART3_CR6_LHDF           UART3_CR6_bit.LHDF
#define UART3_CR6_LHDIEN         UART3_CR6_bit.LHDIEN
#define UART3_CR6_LASE           UART3_CR6_bit.LASE
#define UART3_CR6_LSLV           UART3_CR6_bit.LSLV
#define UART3_CR6_LDUM           UART3_CR6_bit.LDUM

#endif

/*-------------------------------------------------------------------------
 *      UART3 bit masks
 *-----------------------------------------------------------------------*/
#define MASK_UART3_SR_PE         0x01
#define MASK_UART3_SR_FE         0x02
#define MASK_UART3_SR_NF         0x04
#define MASK_UART3_SR_OR         0x08
#define MASK_UART3_SR_IDLE       0x10
#define MASK_UART3_SR_RXNE       0x20
#define MASK_UART3_SR_TC         0x40
#define MASK_UART3_SR_TXE        0x80

#define MASK_UART3_CR1_PIEN      0x01
#define MASK_UART3_CR1_PS        0x02
#define MASK_UART3_CR1_PCEN      0x04
#define MASK_UART3_CR1_WAKE      0x08
#define MASK_UART3_CR1_M         0x10
#define MASK_UART3_CR1_UARTD     0x20
#define MASK_UART3_CR1_T8        0x40
#define MASK_UART3_CR1_R8        0x80

#define MASK_UART3_CR2_SBK       0x01
#define MASK_UART3_CR2_RWU       0x02
#define MASK_UART3_CR2_REN       0x04
#define MASK_UART3_CR2_TEN       0x08
#define MASK_UART3_CR2_ILIEN     0x10
#define MASK_UART3_CR2_RIEN      0x20
#define MASK_UART3_CR2_TCIEN     0x40
#define MASK_UART3_CR2_TIEN      0x80

#define MASK_UART3_CR3_STOP      0x30
#define MASK_UART3_CR3_LINEN     0x40

#define MASK_UART3_CR4_ADD       0x0F
#define MASK_UART3_CR4_LBDF      0x10
#define MASK_UART3_CR4_LBDL      0x20
#define MASK_UART3_CR4_LBDIEN    0x40

#define MASK_UART3_CR6_LSF       0x01
#define MASK_UART3_CR6_LHDF      0x02
#define MASK_UART3_CR6_LHDIEN    0x04
#define MASK_UART3_CR6_LASE      0x10
#define MASK_UART3_CR6_LSLV      0x20
#define MASK_UART3_CR6_LDUM      0x80


/*-------------------------------------------------------------------------
 *      TIM1 register definitions
 *-----------------------------------------------------------------------*/
/* TIM1 control register 1 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CEN         : 1;
  unsigned char UDIS        : 1;
  unsigned char URS         : 1;
  unsigned char OPM         : 1;
  unsigned char DIR         : 1;
  unsigned char CMS         : 2;
  unsigned char ARPE        : 1;
} __BITS_TIM1_CR1;
#endif
__IO_REG8_BIT(TIM1_CR1,    0x5250, __READ_WRITE, __BITS_TIM1_CR1);

/* TIM1 control register 2 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CCPG        : 1;
  unsigned char             : 1;
  unsigned char COMS        : 1;
  unsigned char             : 1;
  unsigned char MMS         : 3;
} __BITS_TIM1_CR2;
#endif
__IO_REG8_BIT(TIM1_CR2,    0x5251, __READ_WRITE, __BITS_TIM1_CR2);

/* TIM1 slave mode control register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char SMS         : 3;
  unsigned char             : 1;
  unsigned char TS          : 3;
  unsigned char MSM         : 1;
} __BITS_TIM1_SMCR;
#endif
__IO_REG8_BIT(TIM1_SMCR,   0x5252, __READ_WRITE, __BITS_TIM1_SMCR);

/* TIM1 external trigger register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char ETF         : 4;
  unsigned char ETPS        : 2;
  unsigned char ECE         : 1;
  unsigned char ETP         : 1;
} __BITS_TIM1_ETR;
#endif
__IO_REG8_BIT(TIM1_ETR,    0x5253, __READ_WRITE, __BITS_TIM1_ETR);

/* TIM1 Interrupt enable register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char UIE         : 1;
  unsigned char CC1IE       : 1;
  unsigned char CC2IE       : 1;
  unsigned char CC3IE       : 1;
  unsigned char CC4IE       : 1;
  unsigned char COMIE       : 1;
  unsigned char TIE         : 1;
  unsigned char BIE         : 1;
} __BITS_TIM1_IER;
#endif
__IO_REG8_BIT(TIM1_IER,    0x5254, __READ_WRITE, __BITS_TIM1_IER);

/* TIM1 status register 1 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char UIF         : 1;
  unsigned char CC1IF       : 1;
  unsigned char CC2IF       : 1;
  unsigned char CC3IF       : 1;
  unsigned char CC4IF       : 1;
  unsigned char COMIF       : 1;
  unsigned char TIF         : 1;
  unsigned char BIF         : 1;
} __BITS_TIM1_SR1;
#endif
__IO_REG8_BIT(TIM1_SR1,    0x5255, __READ_WRITE, __BITS_TIM1_SR1);

